# Assignment_4 Group By, Summarization, Aggregation.

In [2]:
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

In [4]:
df = pd.read_csv(r"E:\FingerTips\2.Python\Materials\Pandas_Assignment_4.csv")

In [5]:
df

     index              date  duration  item    month   network network_type
0        0  15/10/2014 06:58    34.429  data  2014-11      data         data
1        1  15/10/2014 06:58    13.000  call  2014-11  Vodafone       mobile
2        2  15/10/2014 14:46    23.000  call  2014-11    Meteor       mobile
3        3  15/10/2014 14:48     4.000  call  2014-11     Tesco       mobile
4        4  15/10/2014 17:27     4.000  call  2014-11     Tesco       mobile
..     ...               ...       ...   ...      ...       ...          ...
825    825  13/03/2015 00:38     1.000   sms  2015-03     world        world
826    826  13/03/2015 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/2015 06:58    34.429  data  2015-03      data         data
828    828  14/03/2015 00:13     1.000   sms  2015-03     world        world
829    829  14/03/2015 00:16     1.000   sms  2015-03     world        world

[830 rows x 7 columns]

### 1) Get the Basic Statistics of Dataset.

In [7]:
df.describe()

            index      duration
count  830.000000    830.000000
mean   414.500000    117.804036
std    239.744656    444.129560
min      0.000000      1.000000
25%    207.250000      1.000000
50%    414.500000     24.500000
75%    621.750000     55.000000
max    829.000000  10528.000000

### 2) Display the data grouped by Month.

In [24]:
df.groupby(['month']).mean()

              index    duration
month
2014-11  114.508696  115.823657
2014-12  308.038217   93.260318
2015-01  489.068293   88.894141
2015-02  659.839416  113.301453
2015-03  779.000000  225.251891

In [42]:
df.groupby(['month']).groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

### 3) Display the data by grouping data month wise.

In [45]:
df.groupby(['month'],as_index=True)

In [54]:
df.groupby(['month']).first()

         index              date  duration  item   network network_type
month
2014-11      0  15/10/2014 06:58    34.429  data      data         data
2014-12    228  13/11/2014 06:58    34.429  data      data         data
2015-01    381  13/12/2014 06:58    34.429  data      data         data
2015-02    577  13/01/2015 06:58    34.429  data      data         data
2015-03    729  12/02/2015 20:15    69.000  call  landline     landline

### 4) Get the sum of duration per month.

In [61]:
df.groupby(['month']).sum()['duration']

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [62]:
df.groupby(['month']).sum()[['duration']]

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

### 5) Show the mean of duration per month.

In [64]:
df.groupby(['month']).mean()[['duration']]

           duration
month
2014-11  115.823657
2014-12   93.260318
2015-01   88.894141
2015-02  113.301453
2015-03  225.251891

### 6) Show the median of duration per month.

In [66]:
df.groupby('month')[['duration']].median()

         duration
month
2014-11     4.000
2014-12    28.000
2015-01     6.000
2015-02    34.429
2015-03    34.429

### 7) Get the minimum duration of call per month.

In [67]:
df.groupby('month')[['duration']].min()

         duration
month
2014-11       1.0
2014-12       1.0
2015-01       1.0
2015-02       1.0
2015-03       1.0

### 8) Get the maximum duration of call per month.

In [70]:
df.groupby('month').max()[['duration']]

         duration
month
2014-11    1940.0
2014-12    2120.0
2015-01    1859.0
2015-02    1863.0
2015-03   10528.0

### 9) Get the first entry for each month.

In [72]:
df.groupby('month')[['duration']].first()

         duration
month
2014-11    34.429
2014-12    34.429
2015-01    34.429
2015-02    34.429
2015-03    69.000

In [73]:
df.groupby('month').first()

         index              date  duration  item   network network_type
month
2014-11      0  15/10/2014 06:58    34.429  data      data         data
2014-12    228  13/11/2014 06:58    34.429  data      data         data
2015-01    381  13/12/2014 06:58    34.429  data      data         data
2015-02    577  13/01/2015 06:58    34.429  data      data         data
2015-03    729  12/02/2015 20:15    69.000  call  landline     landline

### 10) Get the last entry for each month.

In [74]:
df.groupby('month').last()

         index              date  duration  item   network network_type
month
2014-11    230  13/11/2014 22:31     1.000   sms  Vodafone       mobile
2014-12    388  14/12/2014 19:54    25.000  call     Three       mobile
2015-01    593  14/01/2015 23:36     1.000   sms     Three       mobile
2015-02    728  12/02/2015 06:58    34.429  data      data         data
2015-03    829  14/03/2015 00:16     1.000   sms     world        world

In [75]:
df.groupby('month')[['duration']].last()

         duration
month
2014-11     1.000
2014-12    25.000
2015-01     1.000
2015-02    34.429
2015-03     1.000

### 11) Display the number of unique network in the dataset.

In [77]:
df['network'].unique()

array(['data', 'Vodafone', 'Meteor', 'Tesco', 'Three', 'voicemail',
       'landline', 'special', 'world'], dtype=object)

In [78]:
df['network'].nunique()

9

In [83]:
df.groupby('network')['duration'].nunique()

network
Meteor       41
Tesco        62
Three        93
Vodafone     46
data          1
landline     39
special       1
voicemail    24
world         1
Name: duration, dtype: int64

### 12) Which Network has the maximum duration in the dataset.

In [88]:
df.groupby('network')[['duration']].max()

            duration
network
Meteor      1090.000
Tesco       1234.000
Three       2328.000
Vodafone    1859.000
data          34.429
landline   10528.000
special        1.000
voicemail    174.000
world          1.000

In [90]:
df.groupby('network')[['duration']].max()

            duration
network
Meteor      1090.000
Tesco       1234.000
Three       2328.000
Vodafone    1859.000
data          34.429
landline   10528.000
special        1.000
voicemail    174.000
world          1.000

### 13) How many calls, sms and data entries are in each month?

In [96]:
df.groupby(['month', 'item'])[['date']].count()

              date
month   item
2014-11 call   107
        data    29
        sms     94
2014-12 call    79
        data    30
        sms     48
2015-01 call    88
        data    31
        sms     86
2015-02 call    67
        data    31
        sms     39
2015-03 call    47
        data    29
        sms     25

### 14) How many calls, texts, and data are sent per month, split by network type?

In [98]:
df.groupby('network_type')[['item']].count()

              item
network_type
data           150
landline        42
mobile         601
special          3
voicemail       27
world            7

### 15) Calculate the number of rows per each network type.

In [101]:
df.groupby(['network_type']).size()

network_type
data         150
landline      42
mobile       601
special        3
voicemail     27
world          7
dtype: int64

### 16) Calculate the size of each network in the dataset.

In [102]:
df.groupby('network').size()

network
Meteor        87
Tesco         84
Three        215
Vodafone     215
data         150
landline      42
special        3
voicemail     27
world          7
dtype: int64

### 17) Calculate the standard deviation of duration of each month.

In [103]:
df.groupby('month')[['duration']].std()

            duration
month
2014-11   287.548051
2014-12   243.151296
2015-01   216.853383
2015-02   250.778963
2015-03  1076.018287

### 18) Calculate the variance of network type.

In [104]:
df.groupby('network_type').var()

                     index      duration
network_type
data          60312.269530  0.000000e+00
landline      50247.682346  2.661517e+06
mobile        54623.712934  8.126929e+04
special       92596.333333  0.000000e+00
voicemail     67588.165242  1.962046e+03
world         60958.285714  0.000000e+00

### 19) Calculate the variance of duration of calls month wise.

In [105]:
df.groupby('month')[['duration']].var()

             duration
month
2014-11  8.268388e+04
2014-12  5.912255e+04
2015-01  4.702539e+04
2015-02  6.289009e+04
2015-03  1.157815e+06

### 20) Using Aggregation function calculate the min and max of network.

In [109]:
df.aggregate({'network':['min','max']})

    network
min  Meteor
max   world

### 21) Using Aggregation function calculate the min and max of the month.

In [110]:
df.aggregate({'month':['min','max']})

       month
min  2014-11
max  2015-03

### 22) Calculate sum of Duration of the calls using aggregate function.

In [113]:
df.agg({'duration':['sum']})

     duration
sum  97777.35

### 23) Count the total number of item in the dataset.

In [115]:
df.agg({'item' : ['count']})

       item
count   830

In [117]:
df.item.count()

830

### END ###